Revit 2026 API

# NumberSystemSetReferencePick Method

---

Sets the reference pick.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetReferencePick(
	Reference referencePick
)
```
```vb
Public Sub SetReferencePick (
	referencePick As Reference
)
```
```cpp
public:
void SetReferencePick(
	Reference^ referencePick
)
```
```fsharp
member SetReferencePick :
        referencePick : Reference -> unit
```

#### Parameters

referencePick Reference
     The pick to set.

| Exception | Condition |
| --- | --- |
| ArgumentException | The referencePick is not a valid reference. |
| ArgumentNullException | A non-optional argument was null |

It is suggested to get the new reference via GetNumberSystemReference() from the host element.

#### Reference

NumberSystem Class

Autodesk.Revit.DB Namespace